allocate (A(0:N), source=0)
! A == [0, ..., 0]

do i = 1, N
   A(i) = i ! ВЕКТОРИЗАЦИЯ ВОЗМОЖНА
end do

! МОжет проводиться как:
! A(4:7) = A(0:3) + 4


A = [(i, i = 0, N)]
! A == [0, 1, ..., N]
! A == [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, ...]
do i = 5, N
   A(i) = A(i-5) + 1
end do
! A(5) = A(0) + 1
! A(6) = A(1) + 1
! A(7) = A(2) + 1
! A(8) = A(3) + 1
! A(9) = A(4) + 1
! A(10) = A(5) + 1
! A(11) = A(6) + 1
! A(12) = A(7) + 1
! A(13) = A(8) + 1
! A(14) = A(9) + 1
! A(15) = A(10) + 1
! A(16) = A(11) + 1
! ...
! A == [0, 1, 2, 3, 4, 1, 2, 3, 4, 5, 2, 3, 4, 5, 6, 3, 4, 5, 6, 7, 4, 5, 6, 7, 8, ...]
! i ==  0  1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16

do i = 5, N
   A(i) = A(i-5) + 1
end do
! Задействуются векторные инструкции SSE (SIMD)
! A(5:8) = A(0:3) + 1
! A(9:12) = A(4:7) + 1
! A(13:16) = A(8:11) + 1
! ...
! A == [0, 1, 2, 3, 4, 1, 2, 3, 4, 5, 2, 3, 4, 5, 6, 3, 4, 5
! i ==  0  1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17

! A(5:9) = A(0:4) + 1
! A(10:14) = A(0:4) + 2
! A(15:19) = A(0:4) + 3

do i = 1, N / 5 - 4
   A(i*5:i*5 + 4) = A(0:4) + i
end do
! A(5:N) = [A(0:4) + 1, A(0:4) + 2, A(0:4) + 3, ...]
! Современная запись (без зависимостей между итерациями:
A(5:N) = [(A(0:4) + i, i = 1, N/5 -4)] ! !!!

! НЕ ВЕКТОРИЗУЕТСЯ ИЗ-ЗА УСЛОВИЯ В ЦИКЛЕ
do i = 5, N
   if (mod(i, 10) == 0) &
      A(i) = A(i-5) + 1
end do

! Отсутствует условие в цикле, но нечего векторизовать:
do i = 10, N, 10
      A(i) = A(i-5) + 1
end do

A(1:N)
Addr(A(1)) == 64 -- выровнен, т. к. делится на 64, поэтому он 
может участвовать в векторизации:
B(1:7) = A(1:7) + 6
Addr(A(1)) == 4 -- НЕ выровнен, т. к. НЕ делится на 64
Addr(A(2)) == 8 -- НЕ выровнен, т. к. НЕ делится на 64
...
Addr(A(16)) == 64 -- выровнен, т. к. Делится на 64
может участвовать в векторизации:
B(16:23) = A(16:23) + 6
