real :: C(5, 3), A(5, 3), B(5, 3)

...

do j = 1, 3
   do i = 1, 5
      C(i, j) = A(i, j) + B(i, j)
   end do
   
   !   C(1:5, j) = A(1:5, j) + B(1:5, j)
  
end do

A == [
1  6 11
2  7 12
3  8 13
4  9 14
5 10 15

A = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]
addr 0  4  8 12 16 20 24 28 32  36  40  44  48  52  56
alig V                       V                        
vect V  V  V  V  X  X  X  X  V   V   X   X   V   V   X

C = A + B

k = 1, 15, 4
C((1:4)) = A((1:4)) + B((1:4))
C((5:8)) = A((5:8)) + B((5:8))
C((9:12)) = A((9:12)) + B((9:12))
C((13:14)) = A((13:14)) + B((13:14))
C((15)) = A((15)) + B((15))


A = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]
addr 0  4  8 12 16 20 24 28 32  36  40  44  48  52  56
alig V                       V
vect V  V  V  V  V  V  V  V  V   V   V   V   V   V   X

если работаем по строкам
* переписиываем алгоритм по работе со столбцами
* договариваемся в комментариях A(j, i)
read (In, *) N, M
! A(j, i) -- j -- номер столбца, i -- номер строки
allocate(A(M, N))
! A(:, 1) -- первая строка

!read (In, *) (A(:, i), i = 1, N)
read (In, *) A

если работаем со столбцами
* стараемся использовать регулярное програмирование
* отступы (padding)

real :: C(5+3, 3), A(5+3, 3), B(5+3, 3)
A == [
1  6 11
2  7 12
3  8 13
4  9 14
5 10 15
X  X  X
X  X  X
X  X  X

КАЖДЫЙ СТОЛБЕЦ ВЫРОВНЕН

ОБРАБОТКА МАССИВА A(5, 3) ПРОВОДИТСЯ ЗА 10 ОПЕРАЦИЙ
ОБРАБОТКА МАССИВА A(8, 3) ПРОВОДИТСЯ ЗА 6 ОПЕРАЦИЙ

do j = 1, 3
   do i = 1, 8
      C(i, j) = A(i, j) + B(i, j)
   end do
end do
